[{"id":1701554400,"title":"Freshings\r","author":"Mxo Masuku\r","date":"03 December 2023\r","content":"# Welcome to the blog\r\n## This is amazing innit?\r\n\r\nThe man who just wouldn't quit!\r\n\r\nDid I mention, the Colleges are good for the transport sector and real estate too?\r\n\r\nIn Kwekwe, the men were extremely motivated. Gold was the industry and it is unpredictable as hell and only one rule applies,\"You either got it or you don't.\" As such the men, realizing they had no control over when they get to the gold develop an aggressive attitude towards each other. To put it lightly, Kwekwe was a violent and vicious town. The men in there specialized in killing each other and eliminating threats. Also, and perhaps more importantly, in taking each other's resources. \r\n\r\n<iframe width='560px' height='315' src='https://www.youtube.com/embed/QH35UAqHLi0' frameborder='0' allow='accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe>"},{"id":1699308000,"title":"enemies to the east.\r","author":"Mxolisi Masuku\r","date":"07 November 2023\r","content":"\r\nWhen his enemies surrounded him, he let out a sharp scream!!!!!! Lord lord lord!\r\nBefore I moved to Harare, I worked in Kwekwe for 10 years. That's when I started my service in the Central Investigations Department C.I.D. Kwekwe is a city like no other but in some sense, it has a recipe which most cities in Zimbabwe are built on. \r\n\r\nThe first ingredient to make a successful town is a University, College or Polytechnic. If you are one of the believers, you are probably thinking, this is good for education bla bla bla. And you are wrong to think that. A university or college ensures a consistent supply of fresh young pussy and women for the city. This is enough to keep the young men, and older enough motivation to work. It will ensure that the clubs are full, the clinics are vibrant, and visiting the CBD is rewarding. Whether you can get them or they are out of your league, who doesn't like seeing young youthful vibrant women doing their thing and showing off skin to anyone gracious enough to look? "},{"id":1682373600,"title":"Why you need React for your Web architecture\r","author":"Mxo Masuku\r","date":"25 April 2023\r","content":"\r\n# Why you should consider building your web app on top of React?\r\n\r\nReact is gold! Seriously. It is that one technology on the web that looks like it's not going away anytime soon. It has changed the way developers build website and thought of the web, and its children Next.Js, Nuxt etc continue to do at an astounding pace. Like I said, it is the gold that every other web economy is built upon. \r\n\r\nBut just because React is gold, doesn't mean there aren't any other economies built on other commodities like Oil, Agriculture etc. Those are your other technologies like Angular, Bubble, WordPress etc. \r\n\r\n### What you should be looking for \r\nPower. Control. Flexibility. Speed. Affordability And great cutting edge support in the unlikely event that something goes wrong.\r\n\r\nIf you are here, there is a chance that you have come across ads about no-code platforms like Bubble that tell you that you can develop a website or webapp in 30 minutes! Don't buy that crap. They are costly. Unless your business is making tonnes of money and can afford to pay Bubble a substational fee to host your App then don't do it. Plus, as you will notice, 30 minutes isn't 30 minutes. You should also know some foundational CSS, Design Principles and Prototyping. \r\n\r\nWhat React offers you, is the ability to hire someone (like me), to develop an app for you, and when they do. They built a small, light and lightining fast website to help you showcase whatever goodies you want the world to see. This very site you are on, is built on React. Look how fast it is. \r\n\r\nWhat's beautiful is that you never have to worry about the code, because I will set you and your team up nicely on a good CMS (Content Management System) that will make posting on your website as simple as posting a Tweet. Only that you will be the Elon Musk of your website or web app. \r\n\r\n### Let's talk flexibility for a bit. \r\nThere are certain things that React on its own can't do, like connect to your backend data, server. It was designed mainly for display and presenting data. However, like a good piece of gold, it works well with its children. \r\n\r\nSuppose you have a separate server out there, what do you do? In that case, we either use something called 'react-router-dom', a package designed to give React backend superpowers, or we just go nuclear and use Next.JS. Everyone is using Next.JS these days, I will probably sound like a fool if I go around strutting how deeply immersed I am in React, \r\n\r\nNot to worry though, Next.JS is called a React framework, it was built to help you write and deploy your React App faster. How is that for kids making sure the bloodline lives forever.\r\n\r\n### WordPress vs React.\r\n\r\n"},{"id":1682373600,"title":"useEffect vs Loaders from 'react-router-dom'\r","author":"Mxo Masuku\r","date":"25 April 2023\r","content":"\r\n# useEffect vs Loaders from 'react-router-dom'\r\n\r\n'\r\n\r\n## What are they for?\r\n\r\nThe useEffect hook is React's go-to guy for loading and fetching data from APIs. However, if you have noticed, most people dislike it. (\r\n\r\n## Loaders\r\n\r\nare for loading data into a component before it renders.\r\n\r\nare put outside the component, at the bottom?\r\n\r\n\r\n\r\nThe loader is created as an async function which must be exported to the component. \r\n\r\n\r\n\r\n```react\r\nexport const postLoader = async () => {\r\n    const res = await fetch(' http://localhost:4000/ProjectsDb')\r\n\r\n    console.log(res)\r\n\r\n    return res.json\r\n}\r\n\r\n```\r\n\r\n\r\n\r\n\r\n\r\n**Where should this function be located?** \r\n\r\n*{If you think you are going to create many of these, then you have the option of creating a directory named Loaders, or anything you like and add all your Loaders.js files with your Loader functions there. The key thing is adding it to the route.}*\r\n\r\n **How do you add it to the route?**\r\n\r\n```react\r\n<Route index element={<Writing/>} \tloader={postLoader}/>\r\n```\r\n\r\n\r\n\r\n## Step 3\r\n\r\nGo to the component you want to render the content on and \r\n\r\nimport a hook from 'react-router-dom' called useLoaderData\r\n\r\n```react\r\nimport {useLoaderData} from \"react-router-dom\"\r\n\r\nconst post = useLoaderData()\r\n\r\n```\r\n\r\nThe post variable will be an array which you can map, loop over and render. \r\n\r\n\r\n\r\n## How is this better than the useEffect hook? Coz frankly it seems like a lot of work.\r\n\r\n​\t\r\n"}]